package ex2_class;

public class Ex2_Instance {
	public static void main(String[] args) {
		/* 인스턴스 (kth p232)
		 * 	- 객체를 만드는 과정을 클래스의 인스턴스화라고 부르며 어떤 클래스로부터 만들어진 객체를 해당 클래스의 인스턴스라고 부른다.
		 * 	- 인스턴스와 객체는 같은 개념이나, 객체는 모든 인스턴스를 대표하는 포괄적인 개념이다.
		 * 
		 * 		[참고] 클래스 >> (인스턴스화) >> 인스턴스 (객체)
		 * 
		 * 			인스턴스 :  어떤 클래스로부터 만들어진 것.
		 * 			객체 : 클래스로부터 만들어진 것.
		 * 
		 * 		[참고] 객체와 변수의 생성 구조
		 * 			(1) 객체
		 * 				- heap 영역에 데이터가 생성되어, stack 영역에 주소 값을 둔다.
		 * 				- 주소 값을 통해서 데이터 조회
		 * 
		 * 			(2) 변수
		 * 				- stack 영역에 데이터 생성 및 조회가 가능하다.
		 * 
		 * 		[참고] 인스턴스의 생성과 사용
		 * 			(1)	클래스명 변수명;				// 참조변수 선언
		 * 			(2) 변수명 = new 클래스명();		// 클래스의 객체 생성 후, 객체의 주소를 참조변수에 저장
		 */
	}
}
