package ex1_java;

public class Ex1_Java {
	public static void main(String[] args) {
		/*	Java
		 * 		- 웹 어플리케이션, 데이터 분석, 개발 및 유지보수에서 가장 광범위하게 사용되는 객체지향 프로그래밍 언어
		 * 		- JDK와 Eclipse으로 동작한다.
		 * 
		 * 		(1) Java 특징
		 * 			(1.1) 독립적 운영체제 : 자바 가상머신에서 운영체제와 자바 간의 통신을 따로 진행해주므로 자바는 운영체제에 종송되지 않는다.
		 * 			(1.2) 객체지향 언어 : 자바는 객체지향 언어로서 상속, 캡슐화, 다형성 등의 속성을 가진다.
		 * 			(1.3) 메모리 관리 : 가비지 컬렉터가 사용하지 않는 메모리를 자동 삭제한다.
		 * 			(1.4) 동적 로딩 : 자바 실행 시, 모든 클래스가 동시에 시작되지 않고 필요한 시점에만 특정 클래스가 로딩되어 실행된다.
		 * 			
		 * 		(2) Jvm (Java Virtual Machine)
		 * 			- 자바 가상 머신
		 * 			- 자바 <> 운영체제 간 자바 언어를 해석하여 운영체제에 전달하는 역할을 한다.
		 * 			- 자바로 작성된 어플리케이션은 반드시 Jvm 환경에서만 실행된다.
		 * 
		 * 			(2.1) Jvm 구성 항목
		 * 				- Jvm : 운영체제에 맞는 Jvm을 통해서 자바 실행 시 프로그래밍 언어를 해석하여 운영체제에 전달
		 * 				- Os : 운영체제 (하드웨어와 소프트웨어 연결)
		 * 				- 하드웨어 : 컴퓨터 혹은 주변 장치
		 * 				- Class Loader : 메모리 적재 및 컴퓨터가 기억하는 내용을 로드하는 장치
		 * 				- Runtime Data Areas : Ram 영역 관리
		 * 
		 * 		(3) JDK (Java Development Kit)
		 * 			- 자바 개발 도구
		 * 			- Jvm과 자바 클래스 라이브러리를 포함한 자바 개발 시 필요한 프로그램이 담겨있다.
		 * 
		 * 			(3.1) 주요 실행 파일
		 * 				- javac.exe : 자바 컴파일러 (소스 코드를 바이트 코드로 변환한다.)
		 * 				- java.exe : 자바 인터프리터 (컴파일러가 생성한 바이트 코드를 해석하고 실행한다.)
		 * 				- javap.exe : 역 어셈블러 (컴파일된 클래스 파일을 원래의 소스로 변환한다.)
		 */
	}
}
