package ex1_networking;

public class Ex1_Networking {
	public static void main(String[] args) {
		/*	Networking
		 * 		- 두 대 이상의 컴퓨터를 케이블로 연결하여 네트워크를 구성함을 뜻한다.
		 * 		- 현재의 개념에서는 컴퓨터 간 데이터를 주고 받는 것으로 통용된다.
		 * 
		 * 		Client, Server
		 * 			(1) Client
		 * 				- 서비스를 사용하는 컴퓨터
		 * 
		 * 			(1) Server
		 * 				- 서비스를 제공하는 컴퓨터
		 * 				- 서버가 클라이언트로부터 받은 요청을 처리하여 그 결과를 제공한다.
		 * 				- 서버가 제공하는 서비스에따라 메일 서버, 어플리케이션 서버 등이 있다.
		 * 				- 서버에 접속하는 클라이언트의 수에 따라 하나의 서버가 여러가지 서비스를 제공하기도하고 하나의 서비스를 여러대의 서버로 제공하기도 한다.
		 * 				
		 * 				[참고] 클라이언트 & 서버 프로그램
		 * 					- 서버가 서비스를 제공하기위해서는 서버 프로그램이 있어야하며
		 * 					- 클라이언트가 서비스를 제공받기위해서는 클라이언트 프로그램이 있어야 한다.
		 * 					
		 * 					(1.1) 웹서버에 접속하기위해서는 웹 브라우저가 있어야 가능하다.
		 * 					(1.2) ftp서버에 접속하여 파일을 전송받으려면 ftp 프로그램이 필요하다.
		 * 							(파일 공유프로그램의 경우, 클라이언트와 서버 프로그램이 합쳐진 것으로 파일 송수신이 가능하다.)
		 * 
		 * 					#1 서버 기반 모델
		 * 						- 네트워크 구성 시 전용 서버를 두는 방식
		 * 						- 안정적인 서비스의 제공
		 * 						- 공유 데이터의 관리와 보안이 용이
		 * 						- 서버구축비용과 관리 비용이 존재
		 * 
		 * 					#2 P2P 모델
		 * 						- 전용 서버 없이, 각 클라이언트가 서버 역할을 동시에 수행하는 방식
		 * 						- 자원의 활용 극대화가 가능
		 * 						- 자원의 관리가 어렵다.
		 * 						- 보안이 취약
		 */
	}
}
